[Killed] ConditionalExpression
src/application/use-cases/LoginUseCase.ts:56:9
 
     // 1. Resolve target DID
     let targetDid: string = did ?? '';
-    if (!targetDid) {
+    if (true) {
       const keys = await this.storage.listKeys();
       if (keys.length === 0) {
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/LoginUseCase.ts:56:21
 
     // 1. Resolve target DID
     let targetDid: string = did ?? '';
-    if (!targetDid) {
-      const keys = await this.storage.listKeys();
-      if (keys.length === 0) {
-        throw new AuthenticationError('No identities found in storage');
-      }
-      targetDid = keys[0]!;
-    }
+    if (!targetDid) {}
 
     // 2. Retrieve encrypted blob
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/LoginUseCase.ts:66:9
 
     // 2. Retrieve encrypted blob
     const storedBlob = await this.storage.get(targetDid);
-    if (!storedBlob) {
+    if (storedBlob) {
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/LoginUseCase.ts:66:9
 
     // 2. Retrieve encrypted blob
     const storedBlob = await this.storage.get(targetDid);
-    if (!storedBlob) {
+    if (true) {
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/LoginUseCase.ts:72:9
 
     // 3. Decrypt outer blob
     let decryptedBytes: Uint8Array;
-    try {
-      decryptedBytes = this.crypto.decryptVault(
-        fromBase64(storedBlob.wrappedData),
-        password
-      );
-    } catch {
+    try {} catch {
       throw new AuthenticationError('Invalid password or corrupted vault');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/LoginUseCase.ts:77:13
         fromBase64(storedBlob.wrappedData),
         password
       );
-    } catch {
-      throw new AuthenticationError('Invalid password or corrupted vault');
-    }
+    } catch {}
 
     // 4. Parse internal data
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] StringLiteral
src/application/use-cases/LoginUseCase.ts:78:37
         password
       );
     } catch {
-      throw new AuthenticationError('Invalid password or corrupted vault');
+      throw new AuthenticationError("");
     }
 

[Killed] BlockStatement
src/application/use-cases/LoginUseCase.ts:83:9
 
     // 4. Parse internal data
     let internalData: VaultInternalData;
-    try {
-      const json = new TextDecoder().decode(decryptedBytes);
-      internalData = JSON.parse(json);
-    } catch {
+    try {} catch {
       throw new VaultError('Vault data corruption: Invalid JSON', 'CORRUPT_DATA');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] BlockStatement
src/application/use-cases/LoginUseCase.ts:86:13
     try {
       const json = new TextDecoder().decode(decryptedBytes);
       internalData = JSON.parse(json);
-    } catch {
-      throw new VaultError('Vault data corruption: Invalid JSON', 'CORRUPT_DATA');
-    }
+    } catch {}
 
     // 5. Integrity check

[Survived] StringLiteral
src/application/use-cases/LoginUseCase.ts:87:28
       const json = new TextDecoder().decode(decryptedBytes);
       internalData = JSON.parse(json);
     } catch {
-      throw new VaultError('Vault data corruption: Invalid JSON', 'CORRUPT_DATA');
+      throw new VaultError("", 'CORRUPT_DATA');
     }
 

[Killed] EqualityOperator
src/application/use-cases/LoginUseCase.ts:91:9
     }
 
     // 5. Integrity check
-    if (internalData.did !== targetDid) {
+    if (internalData.did === targetDid) {
       throw new VaultError('Integrity error: DID mismatch inside vault', 'INTEGRITY_ERROR');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/LoginUseCase.ts:91:9
     }
 
     // 5. Integrity check
-    if (internalData.did !== targetDid) {
+    if (true) {
       throw new VaultError('Integrity error: DID mismatch inside vault', 'INTEGRITY_ERROR');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ObjectLiteral
src/application/use-cases/LoginUseCase.ts:105:12
     // 7. Establish session
     this.session.establish(client, sessionKey, targetDid, password, internalData.secrets);
 
-    return {
-      did: targetDid,
-      publicKey: client.get_public_key()
-    };
+    return {};
   }
 }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
