[Killed] BlockStatement
src/application/services/SessionManager.ts:61:11
     did: string,
     password: string,
     secrets: Record<string, string>
-  ): void {
-    // Clear any existing session first
-    this.clear();
-    
-    this._session = {
-      client,
-      sessionKey,
-      did,
-      password,
-      secrets: { ...secrets }
-    };
-  }
+  ): void {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:77:17
   /**
    * Clears the current session and frees WASM memory.
    */
-  clear(): void {
-    if (this._session) {
-      try {
-        this._session.client.free();
-      } catch {
-        // Ignore free errors (already freed)
-      }
-      this._session = null;
-    }
-  }
+  clear(): void {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:78:24
    * Clears the current session and frees WASM memory.
    */
   clear(): void {
-    if (this._session) {
-      try {
-        this._session.client.free();
-      } catch {
-        // Ignore free errors (already freed)
-      }
-      this._session = null;
-    }
+    if (this._session) {}
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:78:9
    * Clears the current session and frees WASM memory.
    */
   clear(): void {
-    if (this._session) {
+    if (false) {
       try {
         this._session.client.free();
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:79:11
    */
   clear(): void {
     if (this._session) {
-      try {
-        this._session.client.free();
-      } catch {
+      try {} catch {
         // Ignore free errors (already freed)
       }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:91:30
   /**
    * Checks if there's an active authenticated session.
    */
-  isAuthenticated(): boolean {
-    return this._session !== null;
-  }
+  isAuthenticated(): boolean {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:92:12
    * Checks if there's an active authenticated session.
    */
   isAuthenticated(): boolean {
-    return this._session !== null;
+    return true;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:92:12
    * Checks if there's an active authenticated session.
    */
   isAuthenticated(): boolean {
-    return this._session !== null;
+    return false;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:98:28
   /**
    * Gets the current session state.
    */
-  getState(): SessionState {
-    return {
-      isAuthenticated: this._session !== null,
-      currentDid: this._session?.did ?? null,
-      hasPasswordCache: this._session?.password !== undefined
-    };
-  }
+  getState(): SessionState {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] EqualityOperator
src/application/services/SessionManager.ts:100:24
    */
   getState(): SessionState {
     return {
-      isAuthenticated: this._session !== null,
+      isAuthenticated: this._session === null,
       currentDid: this._session?.did ?? null,
       hasPasswordCache: this._session?.password !== undefined
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
    # Subtest: Initialization

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:100:24
    */
   getState(): SessionState {
     return {
-      isAuthenticated: this._session !== null,
+      isAuthenticated: true,
       currentDid: this._session?.did ?? null,
       hasPasswordCache: this._session?.password !== undefined
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] LogicalOperator
src/application/services/SessionManager.ts:101:19
   getState(): SessionState {
     return {
       isAuthenticated: this._session !== null,
-      currentDid: this._session?.did ?? null,
+      currentDid: this._session?.did && null,
       hasPasswordCache: this._session?.password !== undefined
     };
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] OptionalChaining
src/application/services/SessionManager.ts:101:19
   getState(): SessionState {
     return {
       isAuthenticated: this._session !== null,
-      currentDid: this._session?.did ?? null,
+      currentDid: this._session.did ?? null,
       hasPasswordCache: this._session?.password !== undefined
     };
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] OptionalChaining
src/application/services/SessionManager.ts:102:25
     return {
       isAuthenticated: this._session !== null,
       currentDid: this._session?.did ?? null,
-      hasPasswordCache: this._session?.password !== undefined
+      hasPasswordCache: this._session.password !== undefined
     };
   }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:102:25
     return {
       isAuthenticated: this._session !== null,
       currentDid: this._session?.did ?? null,
-      hasPasswordCache: this._session?.password !== undefined
+      hasPasswordCache: true
     };
   }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
    # Subtest: Initialization

[Timeout] BlockStatement
src/application/services/SessionManager.ts:111:20
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  getDid(): string {
-    this.ensureAuthenticated();
-    return this._session!.did;
-  }
+  getDid(): string {}
 
   /**

[Killed] BlockStatement
src/application/services/SessionManager.ts:121:30
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  getClient(): ICryptoClient {
-    this.ensureAuthenticated();
-    return this._session!.client;
-  }
+  getClient(): ICryptoClient {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:131:31
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  getSessionKey(): Uint8Array {
-    this.ensureAuthenticated();
-    return this._session!.sessionKey;
-  }
+  getSessionKey(): Uint8Array {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:141:25
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  getPassword(): string {
-    this.ensureAuthenticated();
-    return this._session!.password;
-  }
+  getPassword(): string {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:153:41
    * @returns Secret value or null if not found
    * @throws {NotAuthenticatedError} If no active session
    */
-  getSecret(key: string): string | null {
-    this.ensureAuthenticated();
-    return this._session!.secrets[key] ?? null;
-  }
+  getSecret(key: string): string | null {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] LogicalOperator
src/application/services/SessionManager.ts:155:12
    */
   getSecret(key: string): string | null {
     this.ensureAuthenticated();
-    return this._session!.secrets[key] ?? null;
+    return this._session!.secrets[key] && null;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:165:47
    * @param value - Secret value
    * @throws {NotAuthenticatedError} If no active session
    */
-  setSecret(key: string, value: string): void {
-    this.ensureAuthenticated();
-    this._session!.secrets[key] = value;
-  }
+  setSecret(key: string, value: string): void {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:176:35
    * @param key - Secret identifier
    * @throws {NotAuthenticatedError} If no active session
    */
-  deleteSecret(key: string): void {
-    this.ensureAuthenticated();
-    delete this._session!.secrets[key];
-  }
+  deleteSecret(key: string): void {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13
# Subtest: VaultFacade (Integration)
    # Subtest: Initialization
        # Subtest: should initialize successfully

[Killed] BlockStatement
src/application/services/SessionManager.ts:186:43
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  getAllSecrets(): Record<string, string> {
-    this.ensureAuthenticated();
-    return { ...this._session!.secrets };
-  }
+  getAllSecrets(): Record<string, string> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/services/SessionManager.ts:196:39
    * 
    * @throws {NotAuthenticatedError} If no active session
    */
-  private ensureAuthenticated(): void {
-    if (!this._session) {
-      throw new NotAuthenticatedError();
-    }
-  }
+  private ensureAuthenticated(): void {}
 }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/services/SessionManager.ts:197:9
    * @throws {NotAuthenticatedError} If no active session
    */
   private ensureAuthenticated(): void {
-    if (!this._session) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/services/SessionManager.ts:197:9
    * @throws {NotAuthenticatedError} If no active session
    */
   private ensureAuthenticated(): void {
-    if (!this._session) {
+    if (this._session) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
