[Killed] BooleanLiteral
src/application/use-cases/RecoverAccountUseCase.ts:42:66
    * @throws {VaultError} If recovery is not available
    */
   async execute(options: RecoveryOptions): Promise<RecoveryResult> {
-    const { recoveryCode, newPassword, did, rotateRecoveryCode = false } = options;
+    const { recoveryCode, newPassword, did, rotateRecoveryCode = true } = options;
 
     // 1. Resolve target DID
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] LogicalOperator
src/application/use-cases/RecoverAccountUseCase.ts:45:29
     const { recoveryCode, newPassword, did, rotateRecoveryCode = false } = options;
 
     // 1. Resolve target DID
-    let targetDid: string = did ?? '';
+    let targetDid: string = did && '';
     if (!targetDid) {
       const keys = await this.storage.listKeys();

[Killed] BooleanLiteral
src/application/use-cases/RecoverAccountUseCase.ts:46:9
 
     // 1. Resolve target DID
     let targetDid: string = did ?? '';
-    if (!targetDid) {
+    if (targetDid) {
       const keys = await this.storage.listKeys();
       if (keys.length === 0) {
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:46:21
 
     // 1. Resolve target DID
     let targetDid: string = did ?? '';
-    if (!targetDid) {
-      const keys = await this.storage.listKeys();
-      if (keys.length === 0) {
-        throw new AuthenticationError('No vaults found');
-      }
-      targetDid = keys[0]!;
-    }
+    if (!targetDid) {}
 
     // 2. Get stored blob
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] EqualityOperator
src/application/use-cases/RecoverAccountUseCase.ts:48:11
     let targetDid: string = did ?? '';
     if (!targetDid) {
       const keys = await this.storage.listKeys();
-      if (keys.length === 0) {
+      if (keys.length !== 0) {
         throw new AuthenticationError('No vaults found');
       }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/RecoverAccountUseCase.ts:48:11
     let targetDid: string = did ?? '';
     if (!targetDid) {
       const keys = await this.storage.listKeys();
-      if (keys.length === 0) {
+      if (true) {
         throw new AuthenticationError('No vaults found');
       }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/RecoverAccountUseCase.ts:56:9
 
     // 2. Get stored blob
     const stored = await this.storage.get(targetDid);
-    if (!stored) {
+    if (true) {
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/RecoverAccountUseCase.ts:56:9
 
     // 2. Get stored blob
     const stored = await this.storage.get(targetDid);
-    if (!stored) {
+    if (stored) {
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] StringLiteral
src/application/use-cases/RecoverAccountUseCase.ts:57:37
     // 2. Get stored blob
     const stored = await this.storage.get(targetDid);
     if (!stored) {
-      throw new AuthenticationError(`Identity ${targetDid} not found`);
+      throw new AuthenticationError(``);
     }
     

[Killed] BooleanLiteral
src/application/use-cases/RecoverAccountUseCase.ts:60:9
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
     
-    if (!stored.recoveryBlob) {
+    if (stored.recoveryBlob) {
       throw new VaultError(
         'Recovery not available for this identity. It may have been created with an older SDK version.',
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/RecoverAccountUseCase.ts:60:9
       throw new AuthenticationError(`Identity ${targetDid} not found`);
     }
     
-    if (!stored.recoveryBlob) {
+    if (true) {
       throw new VaultError(
         'Recovery not available for this identity. It may have been created with an older SDK version.',
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:69:9
 
     // 3. Decrypt using recovery code
     let decryptedBytes: Uint8Array;
-    try {
-      decryptedBytes = this.crypto.decryptVault(
-        fromBase64(stored.recoveryBlob),
-        recoveryCode
-      );
-    } catch {
+    try {} catch {
       throw new AuthenticationError('Invalid Recovery Code');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:74:13
         fromBase64(stored.recoveryBlob),
         recoveryCode
       );
-    } catch {
-      throw new AuthenticationError('Invalid Recovery Code');
-    }
+    } catch {}
 
     // 4. Parse internal data (validate structure)
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:79:9
     }
 
     // 4. Parse internal data (validate structure)
-    try {
-      const json = new TextDecoder().decode(decryptedBytes);
-      JSON.parse(json) as VaultInternalData;
-    } catch {
+    try {} catch {
       throw new VaultError('Vault data corruption during recovery', 'CORRUPT_DATA');
     }

[Survived] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:82:13
     try {
       const json = new TextDecoder().decode(decryptedBytes);
       JSON.parse(json) as VaultInternalData;
-    } catch {
-      throw new VaultError('Vault data corruption during recovery', 'CORRUPT_DATA');
-    }
+    } catch {}
 
     // 5. Re-encrypt with new password

[Survived] StringLiteral
src/application/use-cases/RecoverAccountUseCase.ts:83:69
       const json = new TextDecoder().decode(decryptedBytes);
       JSON.parse(json) as VaultInternalData;
     } catch {
-      throw new VaultError('Vault data corruption during recovery', 'CORRUPT_DATA');
+      throw new VaultError('Vault data corruption during recovery', "");
     }
 

[Killed] ConditionalExpression
src/application/use-cases/RecoverAccountUseCase.ts:93:9
     let newRecoveryBlob: string;
     let generatedRecoveryCode: string | undefined;
 
-    if (rotateRecoveryCode) {
+    if (false) {
       generatedRecoveryCode = this.generateRecoveryCode();
       const newEncryptedRecovery = this.crypto.encryptVault(decryptedBytes, generatedRecoveryCode);
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:93:29
     let newRecoveryBlob: string;
     let generatedRecoveryCode: string | undefined;
 
-    if (rotateRecoveryCode) {
-      generatedRecoveryCode = this.generateRecoveryCode();
-      const newEncryptedRecovery = this.crypto.encryptVault(decryptedBytes, generatedRecoveryCode);
-      newRecoveryBlob = toBase64(newEncryptedRecovery);
-    } else {
+    if (rotateRecoveryCode) {} else {
       newRecoveryBlob = stored.recoveryBlob;
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:97:12
       generatedRecoveryCode = this.generateRecoveryCode();
       const newEncryptedRecovery = this.crypto.encryptVault(decryptedBytes, generatedRecoveryCode);
       newRecoveryBlob = toBase64(newEncryptedRecovery);
-    } else {
-      newRecoveryBlob = stored.recoveryBlob;
-    }
+    } else {}
 
     // 7. Update storage

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:109:46
     await this.storage.save(targetDid, stored);
 
     // 8. Return result - only include newRecoveryCode if it was generated
-    if (generatedRecoveryCode !== undefined) {
-      return {
-        did: targetDid,
-        newRecoveryCode: generatedRecoveryCode
-      };
-    }
+    if (generatedRecoveryCode !== undefined) {}
     return {
       did: targetDid
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] EqualityOperator
src/application/use-cases/RecoverAccountUseCase.ts:109:9
     await this.storage.save(targetDid, stored);
 
     // 8. Return result - only include newRecoveryCode if it was generated
-    if (generatedRecoveryCode !== undefined) {
+    if (generatedRecoveryCode === undefined) {
       return {
         did: targetDid,
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ObjectLiteral
src/application/use-cases/RecoverAccountUseCase.ts:115:12
         newRecoveryCode: generatedRecoveryCode
       };
     }
-    return {
-      did: targetDid
-    };
+    return {};
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RecoverAccountUseCase.ts:123:42
   /**
    * Generates a high-entropy recovery code.
    */
-  private generateRecoveryCode(): string {
-    const bytes = this.crypto.getRandomValues(RECOVERY_CODE_BYTES);
-    const hex = Array.from(bytes)
-      .map(b => b.toString(16).padStart(2, '0').toUpperCase())
-      .join('');
-    
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
-  }
+  private generateRecoveryCode(): string {}
 }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ArrowFunction
src/application/use-cases/RecoverAccountUseCase.ts:126:12
   private generateRecoveryCode(): string {
     const bytes = this.crypto.getRandomValues(RECOVERY_CODE_BYTES);
     const hex = Array.from(bytes)
-      .map(b => b.toString(16).padStart(2, '0').toUpperCase())
+      .map(() => undefined)
       .join('');
     
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] MethodExpression
src/application/use-cases/RecoverAccountUseCase.ts:126:17
   private generateRecoveryCode(): string {
     const bytes = this.crypto.getRandomValues(RECOVERY_CODE_BYTES);
     const hex = Array.from(bytes)
-      .map(b => b.toString(16).padStart(2, '0').toUpperCase())
+      .map(b => b.toString(16).padStart(2, '0').toLowerCase())
       .join('');
     

[Killed] MethodExpression
src/application/use-cases/RecoverAccountUseCase.ts:129:58
       .map(b => b.toString(16).padStart(2, '0').toUpperCase())
       .join('');
     
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
+    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
   }
 }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] MethodExpression
src/application/use-cases/RecoverAccountUseCase.ts:129:39
       .map(b => b.toString(16).padStart(2, '0').toUpperCase())
       .join('');
     
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
+    return `${RECOVERY_CODE_PREFIX}-${hex}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
   }
 }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
