[Killed] ObjectLiteral
src/application/use-cases/RegisterIdentityUseCase.ts:63:45
     const wrappedSecret = client.export_wrapped_secret(sessionKey);
 
     // 3. Prepare internal vault data structure
-    const internalData: VaultInternalData = {
-      did,
-      wrappedSecret: toBase64(wrappedSecret),
-      salt: toBase64(salt),
-      secrets: {},
-      createdAt: Date.now(),
-    };
+    const internalData: VaultInternalData = {};
 
     const internalJson = JSON.stringify(internalData);
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ObjectLiteral
src/application/use-cases/RegisterIdentityUseCase.ts:94:12
     // 6. Establish authenticated session
     this.session.establish(client, sessionKey, did, password, {});
 
-    return { did, recoveryCode };
+    return {};
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/RegisterIdentityUseCase.ts:101:42
    * Generates a high-entropy recovery code.
    * Format: RK-XXXXXXXX-XXXXXXXX-XXXXXXXX-XXXXXXXX (32 hex chars)
    */
-  private generateRecoveryCode(): string {
-    const bytes = this.crypto.getRandomValues(RECOVERY_CODE_BYTES);
-    const hex = Array.from(bytes)
-      .map(b => b.toString(16).padStart(2, '0').toUpperCase())
-      .join('');
-    
-    // Format: RK-XXXXXXXX-XXXXXXXX-XXXXXXXX-XXXXXXXX
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
-  }
+  private generateRecoveryCode(): string {}
 }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] MethodExpression
src/application/use-cases/RegisterIdentityUseCase.ts:108:78
       .join('');
     
     // Format: RK-XXXXXXXX-XXXXXXXX-XXXXXXXX-XXXXXXXX
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
+    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex}-${hex.slice(24, 32)}`;
   }
 }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] MethodExpression
src/application/use-cases/RegisterIdentityUseCase.ts:108:58
       .join('');
     
     // Format: RK-XXXXXXXX-XXXXXXXX-XXXXXXXX-XXXXXXXX
-    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex.slice(8, 16)}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
+    return `${RECOVERY_CODE_PREFIX}-${hex.slice(0, 8)}-${hex}-${hex.slice(16, 24)}-${hex.slice(24, 32)}`;
   }
 }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
