[Killed] BooleanLiteral
src/application/use-cases/SecretManagementUseCase.ts:42:9
    * @throws {VaultError} If storage operation fails
    */
   async saveSecret(key: string, value: string): Promise<void> {
-    if (!this.session.isAuthenticated()) {
+    if (this.session.isAuthenticated()) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/SecretManagementUseCase.ts:42:9
    * @throws {VaultError} If storage operation fails
    */
   async saveSecret(key: string, value: string): Promise<void> {
-    if (!this.session.isAuthenticated()) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/SecretManagementUseCase.ts:54:9
 
     // Retrieve and update persisted blob
     const stored = await this.storage.get(did);
-    if (!stored) {
+    if (stored) {
       throw new VaultError('Storage corruption during save', 'STORAGE_ERROR');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/SecretManagementUseCase.ts:54:9
 
     // Retrieve and update persisted blob
     const stored = await this.storage.get(did);
-    if (!stored) {
+    if (true) {
       throw new VaultError('Storage corruption during save', 'STORAGE_ERROR');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/application/use-cases/SecretManagementUseCase.ts:89:41
    * @returns The secret value, or null if not found
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  getSecret(key: string): string | null {
-    if (!this.session.isAuthenticated()) {
-      throw new NotAuthenticatedError();
-    }
-    return this.session.getSecret(key);
-  }
+  getSecret(key: string): string | null {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/SecretManagementUseCase.ts:90:9
    * @throws {NotAuthenticatedError} If vault is locked
    */
   getSecret(key: string): string | null {
-    if (!this.session.isAuthenticated()) {
+    if (this.session.isAuthenticated()) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/SecretManagementUseCase.ts:90:9
    * @throws {NotAuthenticatedError} If vault is locked
    */
   getSecret(key: string): string | null {
-    if (!this.session.isAuthenticated()) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/SecretManagementUseCase.ts:104:9
    * @throws {VaultError} If storage operation fails
    */
   async deleteSecret(key: string): Promise<void> {
-    if (!this.session.isAuthenticated()) {
+    if (this.session.isAuthenticated()) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/SecretManagementUseCase.ts:104:9
    * @throws {VaultError} If storage operation fails
    */
   async deleteSecret(key: string): Promise<void> {
-    if (!this.session.isAuthenticated()) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] StringLiteral
src/application/use-cases/SecretManagementUseCase.ts:117:64
     // Re-persist without this secret
     const stored = await this.storage.get(did);
     if (!stored) {
-      throw new VaultError('Storage corruption during delete', 'STORAGE_ERROR');
+      throw new VaultError('Storage corruption during delete', "");
     }
 

[Killed] BlockStatement
src/application/use-cases/SecretManagementUseCase.ts:143:30
    * @returns Array of secret key identifiers
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  listSecretKeys(): string[] {
-    if (!this.session.isAuthenticated()) {
-      throw new NotAuthenticatedError();
-    }
-    return Object.keys(this.session.getAllSecrets());
-  }
+  listSecretKeys(): string[] {}
 }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/application/use-cases/SecretManagementUseCase.ts:144:9
    * @throws {NotAuthenticatedError} If vault is locked
    */
   listSecretKeys(): string[] {
-    if (!this.session.isAuthenticated()) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/application/use-cases/SecretManagementUseCase.ts:144:9
    * @throws {NotAuthenticatedError} If vault is locked
    */
   listSecretKeys(): string[] {
-    if (!this.session.isAuthenticated()) {
+    if (this.session.isAuthenticated()) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
