[Killed] BooleanLiteral
src/logic/VaultFacade.ts:104:28
   // State
   // ============================================================================
 
-  private _isInitialized = false;
+  private _isInitialized = true;
   private _isDisposed = false;
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/logic/VaultFacade.ts:105:25
   // ============================================================================
 
   private _isInitialized = false;
-  private _isDisposed = false;
+  private _isDisposed = true;
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:116:35
    * 
    * @param storage - Optional custom storage adapter (defaults to IndexedDB)
    */
-  constructor(storage?: IStorage) {
-    this._crypto = new WasmCryptoAdapter();
-    this._storage = storage ?? new BrowserStorage();
-    this._session = new SessionManager();
-  }
+  constructor(storage?: IStorage) {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] LogicalOperator
src/logic/VaultFacade.ts:118:21
    */
   constructor(storage?: IStorage) {
     this._crypto = new WasmCryptoAdapter();
-    this._storage = storage ?? new BrowserStorage();
+    this._storage = storage && new BrowserStorage();
     this._session = new SessionManager();
   }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:133:51
    * @returns Promise that resolves when initialization is complete
    * @throws {InitializationError} If WASM loading fails
    */
-  async init(config?: VaultConfig): Promise<void> {
-    this.ensureNotDisposed();
-    
-    if (this._isInitialized) {
-      return; // Idempotent
-    }
-
-    // Configure crypto adapter with custom WASM path if provided
-    if (config?.wasmPath) {
-      this._crypto = new WasmCryptoAdapter({ wasmPath: config.wasmPath });
-    }
-
-    // Initialize WASM
-    await this._crypto.init();
-    
-    // Initialize use cases now that crypto is ready
-    this._initializeUseCases();
-    
-    this._isInitialized = true;
-  }
+  async init(config?: VaultConfig): Promise<void> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:136:9
   async init(config?: VaultConfig): Promise<void> {
     this.ensureNotDisposed();
     
-    if (this._isInitialized) {
+    if (true) {
       return; // Idempotent
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] BlockStatement
src/logic/VaultFacade.ts:136:30
   async init(config?: VaultConfig): Promise<void> {
     this.ensureNotDisposed();
     
-    if (this._isInitialized) {
-      return; // Idempotent
-    }
+    if (this._isInitialized) {}
 
     // Configure crypto adapter with custom WASM path if provided

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:141:9
     }
 
     // Configure crypto adapter with custom WASM path if provided
-    if (config?.wasmPath) {
+    if (true) {
       this._crypto = new WasmCryptoAdapter({ wasmPath: config.wasmPath });
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] OptionalChaining
src/logic/VaultFacade.ts:141:9
     }
 
     // Configure crypto adapter with custom WASM path if provided
-    if (config?.wasmPath) {
+    if (config.wasmPath) {
       this._crypto = new WasmCryptoAdapter({ wasmPath: config.wasmPath });
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/logic/VaultFacade.ts:151:27
     // Initialize use cases now that crypto is ready
     this._initializeUseCases();
     
-    this._isInitialized = true;
+    this._isInitialized = false;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:158:39
    * Initializes all use cases with their dependencies.
    * Called after WASM is ready.
    */
-  private _initializeUseCases(): void {
-    this._registerUseCase = new RegisterIdentityUseCase(
-      this._crypto,
-      this._storage,
-      this._session
-    );
-    
-    this._loginUseCase = new LoginUseCase(
-      this._crypto,
-      this._storage,
-      this._session
-    );
-    
-    this._recoverUseCase = new RecoverAccountUseCase(
-      this._crypto,
-      this._storage
-    );
-    
-    this._secretsUseCase = new SecretManagementUseCase(
-      this._crypto,
-      this._storage,
-      this._session
-    );
-  }
+  private _initializeUseCases(): void {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:194:65
    * @returns Promise resolving to the DID and recovery code
    * @throws {InitializationError} If vault not initialized
    */
-  async register(password: string): Promise<RegistrationResult> {
-    this.ensureInitialized();
-    return this._registerUseCase!.execute({ password });
-  }
+  async register(password: string): Promise<RegistrationResult> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:207:70
    * @returns Promise resolving to the identity info
    * @throws {AuthenticationError} If password is wrong or identity not found
    */
-  async login(password: string, did?: string): Promise<IdentityInfo> {
-    this.ensureInitialized();
-    const input = did !== undefined ? { password, did } : { password };
-    return this._loginUseCase!.execute(input);
-  }
+  async login(password: string, did?: string): Promise<IdentityInfo> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] ConditionalExpression
src/logic/VaultFacade.ts:209:19
    */
   async login(password: string, did?: string): Promise<IdentityInfo> {
     this.ensureInitialized();
-    const input = did !== undefined ? { password, did } : { password };
+    const input = false ? { password, did } : { password };
     return this._loginUseCase!.execute(input);
   }

[Survived] ConditionalExpression
src/logic/VaultFacade.ts:209:19
    */
   async login(password: string, did?: string): Promise<IdentityInfo> {
     this.ensureInitialized();
-    const input = did !== undefined ? { password, did } : { password };
+    const input = true ? { password, did } : { password };
     return this._loginUseCase!.execute(input);
   }

[Killed] BlockStatement
src/logic/VaultFacade.ts:220:75
    * @returns Recovery result with optional new recovery code
    * @throws {AuthenticationError} If recovery code is invalid
    */
-  async recoverAccount(options: RecoveryOptions): Promise<RecoveryResult> {
-    this.ensureInitialized();
-    const result = await this._recoverUseCase!.execute(options);
-    
-    // Auto-login after recovery
-    await this.login(options.newPassword, result.did);
-    
-    return result;
-  }
+  async recoverAccount(options: RecoveryOptions): Promise<RecoveryResult> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:233:16
   /**
    * Locks the vault and clears all sensitive data from memory.
    */
-  lock(): void {
-    this._session.clear();
-  }
+  lock(): void {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:240:30
   /**
    * Checks if the vault is currently unlocked with an active session.
    */
-  isAuthenticated(): boolean {
-    return this._session.isAuthenticated() && !this._isDisposed;
-  }
+  isAuthenticated(): boolean {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:241:12
    * Checks if the vault is currently unlocked with an active session.
    */
   isAuthenticated(): boolean {
-    return this._session.isAuthenticated() && !this._isDisposed;
+    return false;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] LogicalOperator
src/logic/VaultFacade.ts:241:12
    * Checks if the vault is currently unlocked with an active session.
    */
   isAuthenticated(): boolean {
-    return this._session.isAuthenticated() && !this._isDisposed;
+    return this._session.isAuthenticated() || !this._isDisposed;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Timeout] BlockStatement
src/logic/VaultFacade.ts:249:20
    * 
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  getDid(): string {
-    this.ensureAuthenticated();
-    return this._session.getDid();
-  }
+  getDid(): string {}
 
   /**

[Killed] BlockStatement
src/logic/VaultFacade.ts:257:50
   /**
    * Returns a list of DIDs (identities) that exist in local storage.
    */
-  async getStoredIdentities(): Promise<string[]> {
-    this.ensureInitialized();
-    return this._storage.listKeys();
-  }
+  async getStoredIdentities(): Promise<string[]> {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:273:53
    * @returns Promise resolving to the 64-byte Ed25519 signature
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  async sign(data: Uint8Array): Promise<Uint8Array> {
-    this.ensureAuthenticated();
-    return this._session.getClient().sign_data(data);
-  }
+  async sign(data: Uint8Array): Promise<Uint8Array> {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:289:64
    * @param secret - The secret value to store
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  async saveSecret(key: string, secret: string): Promise<void> {
-    this.ensureInitialized();
-    return this._secretsUseCase!.saveSecret(key, secret);
-  }
+  async saveSecret(key: string, secret: string): Promise<void> {}
 
   /**
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:301:56
    * @returns The decrypted value, or null if not found
    * @throws {NotAuthenticatedError} If vault is locked
    */
-  async getSecret(key: string): Promise<string | null> {
-    this.ensureInitialized();
-    return this._secretsUseCase!.getSecret(key);
-  }
+  async getSecret(key: string): Promise<string | null> {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:313:19
   /**
    * Disposes of the vault and releases all resources.
    */
-  dispose(): void {
-    if (this._isDisposed) return;
-    
-    this.lock();
-    this._isInitialized = false;
-    this._isDisposed = true;
-  }
+  dispose(): void {}
 
   // ============================================================================
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:314:9
    * Disposes of the vault and releases all resources.
    */
   dispose(): void {
-    if (this._isDisposed) return;
+    if (true) return;
     
     this.lock();
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] ConditionalExpression
src/logic/VaultFacade.ts:314:9
    * Disposes of the vault and releases all resources.
    */
   dispose(): void {
-    if (this._isDisposed) return;
+    if (false) return;
     
     this.lock();

[Survived] BooleanLiteral
src/logic/VaultFacade.ts:317:27
     if (this._isDisposed) return;
     
     this.lock();
-    this._isInitialized = false;
+    this._isInitialized = true;
     this._isDisposed = true;
   }

[Killed] BooleanLiteral
src/logic/VaultFacade.ts:318:24
     
     this.lock();
     this._isInitialized = false;
-    this._isDisposed = true;
+    this._isDisposed = false;
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:325:37
   // Guard Methods
   // ============================================================================
 
-  private ensureNotDisposed(): void {
-    if (this._isDisposed) {
-      throw new VaultError('VaultFacade has been disposed', 'DISPOSED');
-    }
-  }
+  private ensureNotDisposed(): void {}
 
   private ensureInitialized(): void {
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BlockStatement
src/logic/VaultFacade.ts:326:27
   // ============================================================================
 
   private ensureNotDisposed(): void {
-    if (this._isDisposed) {
-      throw new VaultError('VaultFacade has been disposed', 'DISPOSED');
-    }
+    if (this._isDisposed) {}
   }
 
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:326:9
   // ============================================================================
 
   private ensureNotDisposed(): void {
-    if (this._isDisposed) {
+    if (false) {
       throw new VaultError('VaultFacade has been disposed', 'DISPOSED');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Survived] StringLiteral
src/logic/VaultFacade.ts:327:61
 
   private ensureNotDisposed(): void {
     if (this._isDisposed) {
-      throw new VaultError('VaultFacade has been disposed', 'DISPOSED');
+      throw new VaultError('VaultFacade has been disposed', "");
     }
   }

[Killed] BlockStatement
src/logic/VaultFacade.ts:331:37
     }
   }
 
-  private ensureInitialized(): void {
-    this.ensureNotDisposed();
-    if (!this._isInitialized) {
-      throw new InitializationError('VaultFacade not initialized. Call init() first.');
-    }
-  }
+  private ensureInitialized(): void {}
 
   private ensureAuthenticated(): void {
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:333:9
 
   private ensureInitialized(): void {
     this.ensureNotDisposed();
-    if (!this._isInitialized) {
+    if (false) {
       throw new InitializationError('VaultFacade not initialized. Call init() first.');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] BooleanLiteral
src/logic/VaultFacade.ts:333:9
 
   private ensureInitialized(): void {
     this.ensureNotDisposed();
-    if (!this._isInitialized) {
+    if (this._isInitialized) {
       throw new InitializationError('VaultFacade not initialized. Call init() first.');
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
    # Subtest: Initialization

[Survived] BlockStatement
src/logic/VaultFacade.ts:338:39
     }
   }
 
-  private ensureAuthenticated(): void {
-    this.ensureInitialized();
-    if (!this._session.isAuthenticated()) {
-      throw new NotAuthenticatedError();
-    }
-  }
+  private ensureAuthenticated(): void {}
 }
 

[Killed] BooleanLiteral
src/logic/VaultFacade.ts:340:9
 
   private ensureAuthenticated(): void {
     this.ensureInitialized();
-    if (!this._session.isAuthenticated()) {
+    if (this._session.isAuthenticated()) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)

[Killed] ConditionalExpression
src/logic/VaultFacade.ts:340:9
 
   private ensureAuthenticated(): void {
     this.ensureInitialized();
-    if (!this._session.isAuthenticated()) {
+    if (true) {
       throw new NotAuthenticatedError();
     }
killedBy: All tests
statusReason: > @p47h/vault-js@0.10.1 test
> tsx --test tests/**/*.test.ts


TAP version 13

# Subtest: VaultFacade (Integration)
